k6/results/checkout-v2-output.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\ 
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: F:\Work\Hadha.co\Project\k6\checkout\checkout.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 3m30s max duration (incl. graceful stop):
              * checkout_flow: 5 looping VUs for 3m0s (gracefulStop: 30s)


Run             [ 100% ] setup()
checkout_flow   [   0% ]

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
checkout_flow   [   0% ] 5 VUs  0m00.7s/3m0s

running (0m03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
checkout_flow   [   1% ] 5 VUs  0m01.7s/3m0s

running (0m04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
checkout_flow   [   1% ] 5 VUs  0m02.7s/3m0s

running (0m05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
checkout_flow   [   2% ] 5 VUs  0m03.7s/3m0s

running (0m06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
checkout_flow   [   3% ] 5 VUs  0m04.7s/3m0s

running (0m07.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
checkout_flow   [   3% ] 5 VUs  0m05.7s/3m0s

running (0m08.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
checkout_flow   [   4% ] 5 VUs  0m06.7s/3m0s

running (0m09.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
checkout_flow   [   4% ] 5 VUs  0m07.7s/3m0s

running (0m10.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
checkout_flow   [   5% ] 5 VUs  0m08.7s/3m0s

running (0m11.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
checkout_flow   [   5% ] 5 VUs  0m09.7s/3m0s

running (0m12.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
checkout_flow   [   6% ] 5 VUs  0m10.7s/3m0s

running (0m13.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
checkout_flow   [   6% ] 5 VUs  0m11.7s/3m0s

running (0m14.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
checkout_flow   [   7% ] 5 VUs  0m12.7s/3m0s

running (0m15.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
checkout_flow   [   8% ] 5 VUs  0m13.7s/3m0s

running (0m16.0s), 5/5 VUs, 13 complete and 0 interrupted iterations
checkout_flow   [   8% ] 5 VUs  0m14.7s/3m0s

running (0m17.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
checkout_flow   [   9% ] 5 VUs  0m15.7s/3m0s

running (0m18.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
checkout_flow   [   9% ] 5 VUs  0m16.7s/3m0s

running (0m19.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
checkout_flow   [  10% ] 5 VUs  0m17.7s/3m0s

running (0m20.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
checkout_flow   [  10% ] 5 VUs  0m18.7s/3m0s

running (0m21.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
checkout_flow   [  11% ] 5 VUs  0m19.7s/3m0s

running (0m22.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
checkout_flow   [  11% ] 5 VUs  0m20.7s/3m0s

running (0m23.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
checkout_flow   [  12% ] 5 VUs  0m21.7s/3m0s

running (0m24.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
checkout_flow   [  13% ] 5 VUs  0m22.7s/3m0s

running (0m25.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
checkout_flow   [  13% ] 5 VUs  0m23.7s/3m0s

running (0m26.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
checkout_flow   [  14% ] 5 VUs  0m24.7s/3m0s

running (0m27.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
checkout_flow   [  14% ] 5 VUs  0m25.7s/3m0s

running (0m28.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
checkout_flow   [  15% ] 5 VUs  0m26.7s/3m0s

running (0m29.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
checkout_flow   [  15% ] 5 VUs  0m27.7s/3m0s

running (0m30.0s), 5/5 VUs, 27 complete and 0 interrupted iterations
checkout_flow   [  16% ] 5 VUs  0m28.7s/3m0s

running (0m31.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
checkout_flow   [  16% ] 5 VUs  0m29.7s/3m0s

running (0m32.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
checkout_flow   [  17% ] 5 VUs  0m30.7s/3m0s

running (0m33.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
checkout_flow   [  18% ] 5 VUs  0m31.7s/3m0s

running (0m34.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
checkout_flow   [  18% ] 5 VUs  0m32.7s/3m0s

running (0m35.0s), 5/5 VUs, 33 complete and 0 interrupted iterations
checkout_flow   [  19% ] 5 VUs  0m33.7s/3m0s

running (0m36.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
checkout_flow   [  19% ] 5 VUs  0m34.7s/3m0s

running (0m37.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
checkout_flow   [  20% ] 5 VUs  0m35.7s/3m0s

running (0m38.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
checkout_flow   [  20% ] 5 VUs  0m36.7s/3m0s

running (0m39.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
checkout_flow   [  21% ] 5 VUs  0m37.7s/3m0s

running (0m40.0s), 5/5 VUs, 39 complete and 0 interrupted iterations
checkout_flow   [  21% ] 5 VUs  0m38.7s/3m0s

running (0m41.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
checkout_flow   [  22% ] 5 VUs  0m39.7s/3m0s

running (0m42.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
checkout_flow   [  23% ] 5 VUs  0m40.7s/3m0s

running (0m43.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
checkout_flow   [  23% ] 5 VUs  0m41.7s/3m0s

running (0m44.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
checkout_flow   [  24% ] 5 VUs  0m42.7s/3m0s

running (0m45.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
checkout_flow   [  24% ] 5 VUs  0m43.7s/3m0s

running (0m46.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
checkout_flow   [  25% ] 5 VUs  0m44.7s/3m0s

running (0m47.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
checkout_flow   [  25% ] 5 VUs  0m45.7s/3m0s

running (0m48.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
checkout_flow   [  26% ] 5 VUs  0m46.7s/3m0s

running (0m49.0s), 5/5 VUs, 47 complete and 0 interrupted iterations
checkout_flow   [  26% ] 5 VUs  0m47.7s/3m0s

running (0m50.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
checkout_flow   [  27% ] 5 VUs  0m48.7s/3m0s

running (0m51.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
checkout_flow   [  28% ] 5 VUs  0m49.7s/3m0s

running (0m52.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
checkout_flow   [  28% ] 5 VUs  0m50.7s/3m0s

running (0m53.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
checkout_flow   [  29% ] 5 VUs  0m51.7s/3m0s

running (0m54.0s), 5/5 VUs, 52 complete and 0 interrupted iterations
checkout_flow   [  29% ] 5 VUs  0m52.7s/3m0s

running (0m55.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
checkout_flow   [  30% ] 5 VUs  0m53.7s/3m0s

running (0m56.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
checkout_flow   [  30% ] 5 VUs  0m54.7s/3m0s

running (0m57.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
checkout_flow   [  31% ] 5 VUs  0m55.7s/3m0s

running (0m58.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
checkout_flow   [  31% ] 5 VUs  0m56.7s/3m0s

running (0m59.0s), 5/5 VUs, 57 complete and 0 interrupted iterations
checkout_flow   [  32% ] 5 VUs  0m57.7s/3m0s

running (1m00.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
checkout_flow   [  33% ] 5 VUs  0m58.7s/3m0s

running (1m01.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
checkout_flow   [  33% ] 5 VUs  0m59.7s/3m0s

running (1m02.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
checkout_flow   [  34% ] 5 VUs  1m00.7s/3m0s

running (1m03.0s), 5/5 VUs, 62 complete and 0 interrupted iterations
checkout_flow   [  34% ] 5 VUs  1m01.7s/3m0s

running (1m04.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
checkout_flow   [  35% ] 5 VUs  1m02.7s/3m0s

running (1m05.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
checkout_flow   [  35% ] 5 VUs  1m03.7s/3m0s

running (1m06.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
checkout_flow   [  36% ] 5 VUs  1m04.7s/3m0s

running (1m07.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
checkout_flow   [  36% ] 5 VUs  1m05.7s/3m0s

running (1m08.0s), 5/5 VUs, 67 complete and 0 interrupted iterations
checkout_flow   [  37% ] 5 VUs  1m06.7s/3m0s

running (1m09.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
checkout_flow   [  38% ] 5 VUs  1m07.7s/3m0s

running (1m10.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
checkout_flow   [  38% ] 5 VUs  1m08.7s/3m0s

running (1m11.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
checkout_flow   [  39% ] 5 VUs  1m09.7s/3m0s

running (1m12.0s), 5/5 VUs, 71 complete and 0 interrupted iterations
checkout_flow   [  39% ] 5 VUs  1m10.7s/3m0s

running (1m13.0s), 5/5 VUs, 72 complete and 0 interrupted iterations
checkout_flow   [  40% ] 5 VUs  1m11.7s/3m0s

running (1m14.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
checkout_flow   [  40% ] 5 VUs  1m12.7s/3m0s

running (1m15.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
checkout_flow   [  41% ] 5 VUs  1m13.7s/3m0s

running (1m16.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
checkout_flow   [  41% ] 5 VUs  1m14.7s/3m0s

running (1m17.0s), 5/5 VUs, 76 complete and 0 interrupted iterations
checkout_flow   [  42% ] 5 VUs  1m15.7s/3m0s

running (1m18.0s), 5/5 VUs, 77 complete and 0 interrupted iterations
checkout_flow   [  43% ] 5 VUs  1m16.7s/3m0s

running (1m19.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
checkout_flow   [  43% ] 5 VUs  1m17.7s/3m0s

running (1m20.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
checkout_flow   [  44% ] 5 VUs  1m18.7s/3m0s

running (1m21.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
checkout_flow   [  44% ] 5 VUs  1m19.7s/3m0s

running (1m22.0s), 5/5 VUs, 82 complete and 0 interrupted iterations
checkout_flow   [  45% ] 5 VUs  1m20.7s/3m0s

running (1m23.0s), 5/5 VUs, 83 complete and 0 interrupted iterations
checkout_flow   [  45% ] 5 VUs  1m21.7s/3m0s

running (1m24.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
checkout_flow   [  46% ] 5 VUs  1m22.7s/3m0s

running (1m25.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
checkout_flow   [  46% ] 5 VUs  1m23.7s/3m0s

running (1m26.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
checkout_flow   [  47% ] 5 VUs  1m24.7s/3m0s

running (1m27.0s), 5/5 VUs, 87 complete and 0 interrupted iterations
checkout_flow   [  48% ] 5 VUs  1m25.7s/3m0s

running (1m28.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
checkout_flow   [  48% ] 5 VUs  1m26.7s/3m0s

running (1m29.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
checkout_flow   [  49% ] 5 VUs  1m27.7s/3m0s

running (1m30.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
checkout_flow   [  49% ] 5 VUs  1m28.7s/3m0s

running (1m31.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
checkout_flow   [  50% ] 5 VUs  1m29.7s/3m0s

running (1m32.0s), 5/5 VUs, 92 complete and 0 interrupted iterations
checkout_flow   [  50% ] 5 VUs  1m30.7s/3m0s

running (1m33.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
checkout_flow   [  51% ] 5 VUs  1m31.7s/3m0s

running (1m34.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
checkout_flow   [  51% ] 5 VUs  1m32.7s/3m0s

running (1m35.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
checkout_flow   [  52% ] 5 VUs  1m33.7s/3m0s

running (1m36.0s), 5/5 VUs, 96 complete and 0 interrupted iterations
checkout_flow   [  53% ] 5 VUs  1m34.7s/3m0s

running (1m37.0s), 5/5 VUs, 98 complete and 0 interrupted iterations
checkout_flow   [  53% ] 5 VUs  1m35.7s/3m0s

running (1m38.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
checkout_flow   [  54% ] 5 VUs  1m36.7s/3m0s

running (1m39.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
checkout_flow   [  54% ] 5 VUs  1m37.7s/3m0s

running (1m40.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
checkout_flow   [  55% ] 5 VUs  1m38.7s/3m0s

running (1m41.0s), 5/5 VUs, 101 complete and 0 interrupted iterations
checkout_flow   [  55% ] 5 VUs  1m39.7s/3m0s

running (1m42.0s), 5/5 VUs, 103 complete and 0 interrupted iterations
checkout_flow   [  56% ] 5 VUs  1m40.7s/3m0s

running (1m43.0s), 5/5 VUs, 105 complete and 0 interrupted iterations
checkout_flow   [  56% ] 5 VUs  1m41.7s/3m0s

running (1m44.0s), 5/5 VUs, 105 complete and 0 interrupted iterations
checkout_flow   [  57% ] 5 VUs  1m42.7s/3m0s

running (1m45.0s), 5/5 VUs, 105 complete and 0 interrupted iterations
checkout_flow   [  58% ] 5 VUs  1m43.7s/3m0s

running (1m46.0s), 5/5 VUs, 108 complete and 0 interrupted iterations
checkout_flow   [  58% ] 5 VUs  1m44.7s/3m0s

running (1m47.0s), 5/5 VUs, 109 complete and 0 interrupted iterations
checkout_flow   [  59% ] 5 VUs  1m45.7s/3m0s

running (1m48.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
checkout_flow   [  59% ] 5 VUs  1m46.7s/3m0s

running (1m49.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
checkout_flow   [  60% ] 5 VUs  1m47.7s/3m0s

running (1m50.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
checkout_flow   [  60% ] 5 VUs  1m48.7s/3m0s

running (1m51.0s), 5/5 VUs, 113 complete and 0 interrupted iterations
checkout_flow   [  61% ] 5 VUs  1m49.7s/3m0s

running (1m52.0s), 5/5 VUs, 114 complete and 0 interrupted iterations
checkout_flow   [  61% ] 5 VUs  1m50.7s/3m0s

running (1m53.0s), 5/5 VUs, 115 complete and 0 interrupted iterations
checkout_flow   [  62% ] 5 VUs  1m51.7s/3m0s

running (1m54.0s), 5/5 VUs, 115 complete and 0 interrupted iterations
checkout_flow   [  63% ] 5 VUs  1m52.7s/3m0s

running (1m55.0s), 5/5 VUs, 115 complete and 0 interrupted iterations
checkout_flow   [  63% ] 5 VUs  1m53.7s/3m0s

running (1m56.0s), 5/5 VUs, 118 complete and 0 interrupted iterations
checkout_flow   [  64% ] 5 VUs  1m54.7s/3m0s

running (1m57.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
checkout_flow   [  64% ] 5 VUs  1m55.7s/3m0s

running (1m58.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
checkout_flow   [  65% ] 5 VUs  1m56.7s/3m0s

running (1m59.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
checkout_flow   [  65% ] 5 VUs  1m57.7s/3m0s

running (2m00.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
checkout_flow   [  66% ] 5 VUs  1m58.7s/3m0s

running (2m01.0s), 5/5 VUs, 123 complete and 0 interrupted iterations
checkout_flow   [  66% ] 5 VUs  1m59.7s/3m0s

running (2m02.0s), 5/5 VUs, 125 complete and 0 interrupted iterations
checkout_flow   [  67% ] 5 VUs  2m00.7s/3m0s

running (2m03.0s), 5/5 VUs, 125 complete and 0 interrupted iterations
checkout_flow   [  68% ] 5 VUs  2m01.7s/3m0s

running (2m04.0s), 5/5 VUs, 125 complete and 0 interrupted iterations
checkout_flow   [  68% ] 5 VUs  2m02.7s/3m0s

running (2m05.0s), 5/5 VUs, 127 complete and 0 interrupted iterations
checkout_flow   [  69% ] 5 VUs  2m03.7s/3m0s

running (2m06.0s), 5/5 VUs, 128 complete and 0 interrupted iterations
checkout_flow   [  69% ] 5 VUs  2m04.7s/3m0s

running (2m07.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
checkout_flow   [  70% ] 5 VUs  2m05.7s/3m0s

running (2m08.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
checkout_flow   [  70% ] 5 VUs  2m06.7s/3m0s

running (2m09.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
checkout_flow   [  71% ] 5 VUs  2m07.7s/3m0s

running (2m10.0s), 5/5 VUs, 132 complete and 0 interrupted iterations
checkout_flow   [  71% ] 5 VUs  2m08.7s/3m0s

running (2m11.0s), 5/5 VUs, 133 complete and 0 interrupted iterations
checkout_flow   [  72% ] 5 VUs  2m09.7s/3m0s

running (2m12.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
checkout_flow   [  73% ] 5 VUs  2m10.7s/3m0s

running (2m13.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
checkout_flow   [  73% ] 5 VUs  2m11.7s/3m0s

running (2m14.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
checkout_flow   [  74% ] 5 VUs  2m12.7s/3m0s

running (2m15.0s), 5/5 VUs, 137 complete and 0 interrupted iterations
checkout_flow   [  74% ] 5 VUs  2m13.7s/3m0s

running (2m16.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
checkout_flow   [  75% ] 5 VUs  2m14.7s/3m0s

running (2m17.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
checkout_flow   [  75% ] 5 VUs  2m15.7s/3m0s

running (2m18.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
checkout_flow   [  76% ] 5 VUs  2m16.7s/3m0s

running (2m19.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
checkout_flow   [  76% ] 5 VUs  2m17.7s/3m0s

running (2m20.0s), 5/5 VUs, 142 complete and 0 interrupted iterations
checkout_flow   [  77% ] 5 VUs  2m18.7s/3m0s

running (2m21.0s), 5/5 VUs, 145 complete and 0 interrupted iterations
checkout_flow   [  78% ] 5 VUs  2m19.7s/3m0s

running (2m22.0s), 5/5 VUs, 145 complete and 0 interrupted iterations
checkout_flow   [  78% ] 5 VUs  2m20.7s/3m0s

running (2m23.0s), 5/5 VUs, 145 complete and 0 interrupted iterations
checkout_flow   [  79% ] 5 VUs  2m21.7s/3m0s

running (2m24.0s), 5/5 VUs, 146 complete and 0 interrupted iterations
checkout_flow   [  79% ] 5 VUs  2m22.7s/3m0s

running (2m25.0s), 5/5 VUs, 148 complete and 0 interrupted iterations
checkout_flow   [  80% ] 5 VUs  2m23.7s/3m0s

running (2m26.0s), 5/5 VUs, 150 complete and 0 interrupted iterations
checkout_flow   [  80% ] 5 VUs  2m24.7s/3m0s

running (2m27.0s), 5/5 VUs, 150 complete and 0 interrupted iterations
checkout_flow   [  81% ] 5 VUs  2m25.7s/3m0s

running (2m28.0s), 5/5 VUs, 150 complete and 0 interrupted iterations
checkout_flow   [  81% ] 5 VUs  2m26.7s/3m0s

running (2m29.0s), 5/5 VUs, 151 complete and 0 interrupted iterations
checkout_flow   [  82% ] 5 VUs  2m27.7s/3m0s

running (2m30.0s), 5/5 VUs, 153 complete and 0 interrupted iterations
checkout_flow   [  83% ] 5 VUs  2m28.7s/3m0s

running (2m31.0s), 5/5 VUs, 155 complete and 0 interrupted iterations
checkout_flow   [  83% ] 5 VUs  2m29.7s/3m0s

running (2m32.0s), 5/5 VUs, 155 complete and 0 interrupted iterations
checkout_flow   [  84% ] 5 VUs  2m30.7s/3m0s

running (2m33.0s), 5/5 VUs, 156 complete and 0 interrupted iterations
checkout_flow   [  84% ] 5 VUs  2m31.7s/3m0s

running (2m34.0s), 5/5 VUs, 157 complete and 0 interrupted iterations
checkout_flow   [  85% ] 5 VUs  2m32.7s/3m0s

running (2m35.0s), 5/5 VUs, 158 complete and 0 interrupted iterations
checkout_flow   [  85% ] 5 VUs  2m33.7s/3m0s

running (2m36.0s), 5/5 VUs, 160 complete and 0 interrupted iterations
checkout_flow   [  86% ] 5 VUs  2m34.7s/3m0s

running (2m37.0s), 5/5 VUs, 160 complete and 0 interrupted iterations
checkout_flow   [  86% ] 5 VUs  2m35.7s/3m0s

running (2m38.0s), 5/5 VUs, 161 complete and 0 interrupted iterations
checkout_flow   [  87% ] 5 VUs  2m36.7s/3m0s

running (2m39.0s), 5/5 VUs, 163 complete and 0 interrupted iterations
checkout_flow   [  88% ] 5 VUs  2m37.7s/3m0s

running (2m40.0s), 5/5 VUs, 164 complete and 0 interrupted iterations
checkout_flow   [  88% ] 5 VUs  2m38.7s/3m0s

running (2m41.0s), 5/5 VUs, 165 complete and 0 interrupted iterations
checkout_flow   [  89% ] 5 VUs  2m39.7s/3m0s

running (2m42.0s), 5/5 VUs, 165 complete and 0 interrupted iterations
checkout_flow   [  89% ] 5 VUs  2m40.7s/3m0s

running (2m43.0s), 5/5 VUs, 166 complete and 0 interrupted iterations
checkout_flow   [  90% ] 5 VUs  2m41.7s/3m0s

running (2m44.0s), 5/5 VUs, 168 complete and 0 interrupted iterations
checkout_flow   [  90% ] 5 VUs  2m42.7s/3m0s

running (2m45.0s), 5/5 VUs, 169 complete and 0 interrupted iterations
checkout_flow   [  91% ] 5 VUs  2m43.7s/3m0s

running (2m46.0s), 5/5 VUs, 170 complete and 0 interrupted iterations
checkout_flow   [  91% ] 5 VUs  2m44.7s/3m0s

running (2m47.0s), 5/5 VUs, 171 complete and 0 interrupted iterations
checkout_flow   [  92% ] 5 VUs  2m45.7s/3m0s

running (2m48.0s), 5/5 VUs, 171 complete and 0 interrupted iterations
checkout_flow   [  93% ] 5 VUs  2m46.7s/3m0s

running (2m49.0s), 5/5 VUs, 173 complete and 0 interrupted iterations
checkout_flow   [  93% ] 5 VUs  2m47.7s/3m0s

running (2m50.0s), 5/5 VUs, 175 complete and 0 interrupted iterations
checkout_flow   [  94% ] 5 VUs  2m48.7s/3m0s

running (2m51.0s), 5/5 VUs, 175 complete and 0 interrupted iterations
checkout_flow   [  94% ] 5 VUs  2m49.7s/3m0s

running (2m52.0s), 5/5 VUs, 176 complete and 0 interrupted iterations
checkout_flow   [  95% ] 5 VUs  2m50.7s/3m0s

running (2m53.0s), 5/5 VUs, 177 complete and 0 interrupted iterations
checkout_flow   [  95% ] 5 VUs  2m51.7s/3m0s

running (2m54.0s), 5/5 VUs, 178 complete and 0 interrupted iterations
checkout_flow   [  96% ] 5 VUs  2m52.7s/3m0s

running (2m55.0s), 5/5 VUs, 180 complete and 0 interrupted iterations
checkout_flow   [  96% ] 5 VUs  2m53.7s/3m0s

running (2m56.0s), 5/5 VUs, 180 complete and 0 interrupted iterations
checkout_flow   [  97% ] 5 VUs  2m54.7s/3m0s

running (2m57.0s), 5/5 VUs, 181 complete and 0 interrupted iterations
checkout_flow   [  98% ] 5 VUs  2m55.7s/3m0s

running (2m58.0s), 5/5 VUs, 182 complete and 0 interrupted iterations
checkout_flow   [  98% ] 5 VUs  2m56.7s/3m0s

running (2m59.0s), 5/5 VUs, 184 complete and 0 interrupted iterations
checkout_flow   [  99% ] 5 VUs  2m57.7s/3m0s

running (3m00.0s), 5/5 VUs, 185 complete and 0 interrupted iterations
checkout_flow   [  99% ] 5 VUs  2m58.7s/3m0s

running (3m01.0s), 5/5 VUs, 185 complete and 0 interrupted iterations
checkout_flow   [ 100% ] 5 VUs  2m59.7s/3m0s

running (3m02.0s), 5/5 VUs, 186 complete and 0 interrupted iterations
checkout_flow Ôåô [ 100% ] 5 VUs  3m0s

running (3m03.0s), 3/5 VUs, 188 complete and 0 interrupted iterations
checkout_flow Ôåô [ 100% ] 5 VUs  3m0s

running (3m04.0s), 2/5 VUs, 189 complete and 0 interrupted iterations
checkout_flow Ôåô [ 100% ] 5 VUs  3m0s

running (3m05.0s), 1/5 VUs, 190 complete and 0 interrupted iterations
checkout_flow Ôåô [ 100% ] 5 VUs  3m0s

     Ôûê setup

       Ô£ô setup_products ÔÇö HTTP 2xx

     Ôûê Checkout Pre-Flow

       Ô£ô checkout_view_product ÔÇö HTTP 2xx
       Ô£ô checkout ÔÇö product loaded
       Ô£ù checkout_add_to_cart ÔÇö HTTP 2xx
        Ôå│  96% ÔÇö Ô£ô 185 / Ô£ù 6
       Ô£ù checkout ÔÇö item added to cart
        Ôå│  96% ÔÇö Ô£ô 185 / Ô£ù 6
       Ô£ô checkout_verify_cart ÔÇö HTTP 2xx
       Ô£ù checkout ÔÇö cart has items
        Ôå│  96% ÔÇö Ô£ô 185 / Ô£ù 6
       Ô£ù checkout ÔÇö cart has total
        Ôå│  96% ÔÇö Ô£ô 185 / Ô£ù 6
       Ô£ô checkout_cleanup_cart ÔÇö HTTP 2xx

     api_errors.....................: 6      0.03231/s
     api_latency....................: avg=589.92ms min=294.51ms med=552.47ms max=1.31s   p(90)=909.46ms p(95)=920.62ms
   Ô£ù api_success_rate...............: 99.21% 759 out of 765
     checks.........................: 98.43% 1505 out of 1529
     data_received..................: 4.5 MB 24 kB/s
     data_sent......................: 158 kB 849 B/s
     group_duration.................: avg=3.76s    min=3.19s    med=3.77s    max=4.02s   p(90)=3.85s    p(95)=3.89s   
     http_req_blocked...............: avg=23.91┬Ás  min=0s       med=0s       max=11.87ms p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=4.88┬Ás   min=0s       med=0s       max=1.07ms  p(90)=0s       p(95)=0s      
   Ô£ô http_req_duration..............: avg=589.92ms min=294.51ms med=552.47ms max=1.31s   p(90)=909.46ms p(95)=920.62ms
       { expected_response:true }...: avg=591.98ms min=336.82ms med=552.58ms max=1.31s   p(90)=909.68ms p(95)=920.73ms
   Ô£ù http_req_failed................: 0.78%  6 out of 765
     http_req_receiving.............: avg=1.47ms   min=0s       med=547.79┬Ás max=15.24ms p(90)=4.88ms   p(95)=7.51ms  
     http_req_sending...............: avg=3.19┬Ás   min=0s       med=0s       max=719.2┬Ás p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=588.44ms min=294.1ms  med=550.97ms max=1.31s   p(90)=908.3ms  p(95)=919.33ms
     http_reqs......................: 765    4.119498/s
     iteration_duration.............: avg=4.77s    min=4.34s    med=4.77s    max=5.16s   p(90)=4.94s    p(95)=4.98s   
     iterations.....................: 191    1.028528/s
     vus............................: 1      min=0            max=5
     vus_max........................: 5      min=5            max=5


running (3m05.7s), 0/5 VUs, 191 complete and 0 interrupted iterations
checkout_flow Ô£ô [ 100% ] 5 VUs  3m0s
k6.exe : time="2026-07-16T17:17:47+05:30" level=error msg="thresholds on metrics 'api_success_rate, http_req_failed' 
have been crossed"
At line:1 char:11
+ $Output = & "C:\Users\Admin\AppData\Local\Temp\k6.exe" run "F:\Work\H ...
+           ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (time="2026-07-1...e been crossed":String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError